code-review/NRB_3471_3546/База_Стало/DataProcessors/НазначениеУслугПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>НазначениеУслугПоДоговору</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/РегистрНазначенныхКомиссий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РегистрНазначенныхКомиссий</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФлагАктивности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИзменениеТарифногоПлана</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиТарифногоПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/НазначениеУслугПоДоговору/Ext/ObjectModule.bsl
Процедура УстановитьУслугиПоДоговору() Экспорт
	
	Период = ?(ЗначениеЗаполнено(Дата), Дата, Договор.ДатаНачалоДействия);
	Набор = РегистрыСведений.РегистрНазначенныхКомиссий.СоздатьНаборЗаписей();
	Набор.Отбор.ДоговорКонтрагента.Установить(Договор);	
	Набор.Отбор.Период.Установить(Период);
	Набор.Прочитать();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УслугиТарифногоПлана.Услуга КАК Услуга
	|ИЗ
	|	Справочник.ТарифныеПланы.УслугиТарифногоПлана КАК УслугиТарифногоПлана
	|ГДЕ
	|	УслугиТарифногоПлана.Ссылка = &ТарифныйПлан
	|	И НЕ УслугиТарифногоПлана.Услуга.НеИспользуется";
	Запрос.УстановитьПараметр("ТарифныйПлан", ТарифныйПлан);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = Набор.Добавить();
		Запись.Период = Период;
		Запись.ДоговорКонтрагента = Договор;
		Запись.Услуга = Выборка.Услуга;
		Запись.ФлагАктивности = Истина;
	КонецЦикла;
	Набор.Записать();
	
КонецПроцедуры
